-- 1. 清空旧数据
TRUNCATE TABLE tb_subject;


-- 2. 插入层级数据
-- Level 1: 大科目
INSERT INTO `tb_subject` (`id`, `name`, `parent_id`, `level`, `sort`) VALUES 
                          (1,   '政治',      0,         1,      10),
                          (2,   '英语一',    0,         1,      20),
                          (3,   '英语二',    0,         1,      21),
                          (4,   '数学一',    0,         1,      30),
                          (5,   '数学二',    0,         1,      31),
                          (6,   '数学三',    0,         1,      32),
                          (7,   '408',       0,         1,      40);
                          
-- Level 2.1: 政治下的科目:前缀 10
INSERT INTO `tb_subject` (`id`, `name`, `parent_id`, `level`, `sort`) VALUES 
                          (101, '马原',     1,          2,       10),
                          (102, '毛中特',   1,          2,       20),
                          (103, '史纲',     1,          2,       30),
                          (104, '思修法基', 1,          2,       40),
                          (105, '时政',     1,          2,       40);

-- Level 2.2: 数学下的科目:前缀 40
INSERT INTO `tb_subject` (`id`, `name`,         `parent_id`, `level`, `sort`) VALUES 
                          (401, '高等数学',          0,         2,     10),
                          (402, '线性代数',          0,         2,     20),
                          (403, '概率论与数理统计',  0,         2,     30);

-- Level 2.3: 408下的科目:前缀 70
INSERT INTO `tb_subject` (`id`, `name`,        `parent_id`, `level`, `sort`) VALUES 
                          (701, '数据结构',         7,         2,      10),
                          (702, '计算机组成原理',   7,         2,      20),
                          (703, '操作系统',         7,         2,      30),
                          (704, '计算机网络',       7,         2,      40); 



-- Level 3.1: 高等数学子类
INSERT INTO `tb_subject` (`id`, `name`,        `parent_id`, `level`, `sort`, `scope`) VALUES 
                         (4011, '函数、极限、连续',401,        3,       10,   '4,5,6'),
                         (4012, '一元微分学',      401,        3,       20,   '4,5,6'),
                         (4013, '一元积分学',      401,        3,       30,   '4,5,6'),
                         (4014, '反常积分',        401,        3,       40,   '4,5,6'),
                         (4015, '微分方程',        401,        3,       50,   '4,5,6'),
                         (4016, '多元微分学',      401,        3,       60,   '4,5,6'),
                         (4017, '二重积分',        401,        3,       70,   '4,5,6');

-- Level 3.2: 线性代数子类
INSERT INTO `tb_subject` (`id`, `name`,                `parent_id`, `level`, `sort`, `scope`) VALUES 
                        (4021, '行列式',                   402,        3,       10,   '4,5,6'),
                        (4022, '矩阵',                     402,        3,       20,   '4,5,6'),
                        (4023, '向量',                     402,        3,       30,   '4,5,6'),
                        (4024, '线性方程组',               402,        3,       40,   '4,5,6'),
                        (4025, '矩阵的特征值和特征向量',   402,        3,       50,   '4,5,6'),
                        (4026, '二次型',                   402,        3,       60,   '4,5,6');

-- Level 3.3: 概率论子类
INSERT INTO `tb_subject` (`id`, `name`,                `parent_id`, `level`, `sort`, `scope`) VALUES 
                        (4031, '随机事件和概率',          403,          3,      1,    '4,6'),
                        (4032, '一维随机变量及其分布',    403,          3,      2,    '4,6'),
                        (4033, '多维随机变量及其分布',    403,          3,      3,    '4,6'),
                        (4034, '随机变量的数字特征',      403,          3,      4,    '4,6'),
                        (4035, '大数定律和中心极限定理',  403,          3,      5,    '4,6'),
                        (4036, '数理统计的基本概念',      403,          3,      6,    '4,6'),
                        (4037, '参数估计与假设检验',      403,          3,      7,    '4');

